question_sheet = {"Q01": ["A. \n나는 가끔 문제해결의 책임을 상대방이 지도록 내버려둘 때도 있다.",
                          "B. 나는 서로가 동의하지 않는 일들에 대해 협상하기보다, 서로가 동의하는 일들에 대해서 강조한다."],

                  "Q02": ["A. 나는 절충안을 찾으려고 노력한다.",
                          "B. 나는 상대방과 나의 관심사를 모두 충족시키려고 노력한다."],

                  "Q03": ["A. 나는 대체로 나의 목표 달성을 위해 끝까지 밀고 나간다.",
                          "B. 나는 상대방의 감정을 상하지 않게 하면서 서로간의 관계를 유지하기 위해 노력한다."],

                  "Q04": ["A. 나는 절충안을 찾으려고 노력한다.",
                          "B. 나는 때때로 상대방이 원하는 것을 위해 내가 원하는 것을 포기할 때가 있다."],

                  "Q05": ["A. 나는 해결책을 찾아내기 위해 끊임없이 상대방에게 도움을 요청한다.",
                          "B. 나는 불필요한 긴장 상태를 피하려고 노력한다."],

                  "Q06": ["A. 나는 될 수 있는 한 불편한 관계/상황을 피하려고 한다.",
                          "B. 나는 내 입장을 끝까지 주장하는 편이다."],

                  "Q07": ["A. 나는 어떤 문제에 대해 총분히 생각할 시간이 있을 때까지 그것을 미루려고 한다.",
                          "B. 나는 어떤 것을 얻는 대신 다른 것을 포기한다."],

                  "Q08": ["A. 나는 대체로 나의 목표 달성을 위해 끝까지 밀고 나간다.",
                          "B. 나는 모든 관심사와 문제들을 망설이지 않고 이야기한다."],

                  "Q09": ["A. 나는 서로 의견이 다른 것에 대해서는 항상 신경 쓸 가치는 없다고 느낀다.",
                          "B. 나는 내 방식대로 일을 처리하려고 노력한다."],

                  "Q10": ["A. 나는 나의 목표 달성을 위해 끝까지 밀고 나간다.",
                          "B. 나는 절충안을 찾으려고 노력한다."],

                  "Q11": ["A. 나는 모든 관심사와 문제들을 망설이지 않고 이야기한다.",
                          "B. 나는 상대방의 감정을 상하지 않게 하면서 서로간의 관계를 유지하기 위해 노력한다."],

                  "Q12": ["A. 나는 때때로 논쟁을 일으킬 수 있는 입장에 서는 것을 피한다.",
                          "B. 나의 입장을 상대방이 어느 정도 이해해 준다면 나도 상대방이 그들의 입장을 어느 정도 주장하도록 한다."],

                  "Q13": ["A. 나는 대체로 절충안을 제안한다.",
                          "B. 나는 내 의견을 관철시킨다."],

                  "Q14": ["A. 나는 상대방에게도 내 생각을 말해주며 그 사람의 생각도 물어본다.",
                          "B. 나는 상대방에게 내 의견의 논리적 근거와 장점을 설멍해 주려고 한다."],

                  "Q15": ["A. 나는 상대방의 감정을 상하지 않게 하면서 서로 간의 관계를 유지하기 위해 노력한다.",
                          "B. 나는 불필요한 긴장 상태를 피하려고 노력한다."],

                  "Q16": ["A. 나는 상대방의 감정을 상하지 않게 하려고 한다.",
                          "B. 나는 상대방에게 내 입장의 장점을 설득시키려고 노력한다."],

                  "Q17": ["A. 나는 대체로 나의 목표 달성을 위해 끝까지 밀고 나간다.",
                          "B. 나는 불필요한 긴장 상태를 피하려고 노력한다."],

                  "Q18": ["A. 나는 만약 상대방이 자신의 의견을 주장하는 것에 기쁨을 느낀다면, 그렇게 하도록 할 것이다.",
                          "B. 나의 입장을 상대방이 어느 정도 이해해 준다면 나도 상대방이 그들의 입장을 어느 정도 주장하도록 한다."],

                  "Q19": ["A. 나는 모든 관심사와 문제들을 망설이지 않고 이야기한다.",
                          "B. 나는 어떤 문제에 대해서 충분히 생각할 시간이 있을 때까지 그것을 미루려고 한다."],

                  "Q20": ["A. 나는 서로간의 의견 차이가 생기면 즉시 해결하려고 노력한다.",
                          "B. 나는 이익과 손해에 대해 상호 모두에게 공정한 입장이 되려고 노력한다."],

                  "Q21": ["A. 나는 협상해 나가는 과정에서 상대방이 바라는 것을 들어주려고 한다.",
                          "B. 나는 항상 문제를 단도직입적으로 이야기하는 펀이다."],

                  "Q22": ["A. 나는 상대방과 내 입장 간의 중간 지점을 찾으려고 노력한다.",
                          "B. 나는 내가 원하는 것을 주장한다."],

                  "Q23": ["A. 나는 자주 우리 모두가 원하는 것을 만족시키는 데 관심을 가진다.",
                          "B. 나는 가끔 문제 해결의 책임을 상대방이 지도록 내버려둘 때도 있다."],

                  "Q24": ["A. 나는 만약 상대방이 자신의 입장이 매우 중요하다고 생각하면 그가 하고 싶은 것을 만족시켜주려고 노력한다.",
                          "B. 나는 상대방이 절충안을 받아들일 수 있도록 노력한다."],

                  "Q25": ["A. 나는 상대방에게 내 의견의 논리적 근거와 장점을 설명해 주려고 한다.",
                          "B. 나는 협상해 나가는 과정에서 상대방이 바라는 것을 들어주려고 한다."],

                  "Q26": ["A. 나는 절충안을 제안한다.",
                          "B. 나는 거의 항상 우리 모두가 원하는 것을 만족시키는 데 관심을 가진다."],

                  "Q27": ["A. 나는 때때로 논쟁을 일으킬 수 있는 입장에 서는 것을 피한다.",
                          "B. 나는 만약 상대방이 자신의 의견을 주장하는 것에 기쁨을 느낀다면, 그렇게 하도록 할 것이다."],

                  "Q28": ["A. 나는 대체로 나의 목표 달성을 위해 끝까지 밀고 나간다.",
                          "B. 나는 보통 해결책을 찾아내기 위해 상대방의 도움을 요청한다."],

                  "Q29": ["A. 나는 절충안을 제안한다.",
                          "B. 나는 서로 의견이 다른 것에 대해서는 항상 신경 쓸 가치는 없다고 느낀다."],

                  "Q30": ["A. 나는 상대방의 감정을 상하지 않게 하려고 한다.",
                          "B. 나는 문제가 있으면 항상 상대방과 의논하여 해결하도록 한다."]
                  }

answer_sheet = {
    'A01' : ["_type04", "_type05"],
    'A02' : ["_type03", "_type02"],
    'A03' : ["_type01", "_type05"],
    'A04' : ["_type03", "_type05"],
    'A05' : ["_type02", "_type04"],
    'A06' : ["_type04", "_type01"],
    'A07' : ["_type04", "_type03"],
    'A08' : ["_type01", "_type02"],
    'A09' : ["_type04", "_type01"],
    'A10' : ["_type01", "_type03"],
    'A11' : ["_type02", "_type05"],
    'A12' : ["_type04", "_type03"],
    'A13' : ["_type03", "_type01"],
    'A14' : ["_type02", "_type01"],
    'A15' : ["_type05", "_type04"],
    'A16' : ["_type05", "_type01"],
    'A17' : ["_type01", "_type04"],
    'A18' : ["_type05", "_type03"],
    'A19' : ["_type02", "_type04"],
    'A20' : ["_type02", "_type03"],
    'A21' : ["_type05", "_type02"],
    'A22' : ["_type03", "_type01"],
    'A23' : ["_type02", "_type04"],
    'A24' : ["_type05", "_type03"],
    'A25' : ["_type01", "_type05"],
    'A26' : ["_type03", "_type02"] ,
    'A27' : ["_type04", "_type05"],
    'A28' : ["_type01", "_type02"],
    'A29' : ["_type03", "_type04"],
    'A30' : ["_type05", "_type02"]

}